app/controllers/produtos_controller.rb

    def index
        @todos_produtos = Produto.order(nome: :asc)
        @produto_mais_barato = Produto.order(:preco).limit(1)
---
SELECT "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]

    def new
        @produto = Produto.new
        @departamentos = Departamento.all
---
SELECT "departamentos".* FROM "departamentos"

    def create
        valores = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade, :departamento_id)
        @novo_produto = Produto.new(valores)
        @departamentos = Departamento.all

        if @novo_produto.save
---
SELECT "departamentos".* FROM "departamentos"
INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at", "departamento_id") VALUES (?, ?, ?, ?, ?, ?, ?)

    def edit
        id = params[:id]
        @produto = Produto.find(id)
        @departamentos = Departamento.all()
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]
SELECT "departamentos".* FROM "departamentos"

    def update
        id = params[:id]
        @produto = Produto.find(id) # busca do BD

        # resgata valores enviados no formulário
        valores = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade, :departamento_id)

        if @produto.update(valores)
            flash[:notice] = "Produto atualizado com sucesso!"
            redirect_to root_url
        else
            @departamentos = Departamento.all
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]
UPDATE "produtos" SET "preco" = ?, "quantidade" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["preco", 333.0], ["quantidade", 12], ["updated_at", "2020-12-23 17:00:27.961275"], ["id", 48]]
SELECT "departamentos".* FROM "departamentos"

    def busca
        @nome = params[:texto_busca]
        @produtos = Produto.where("nome like ?", "%#{@nome}%")
---
SELECT "produtos".* FROM "produtos" WHERE (nome like '%%')