app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
    def set_produto
        id = params[:id]
        @produto = Produto.find(id)