app/controllers/produtos_controller.rb

    def edit
        id = params[:id]
        @produto = Produto.find(id)
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]